lewisf94/Home-Controller/waveshare/esp-idf/sdkconfig.defaults
# ESP32-P4 (Waveshare 4.3" 480x800) -- direct-Spotify build.
# Grounded in the Waveshare 04_wifistation + 08_lvgl_demo_v9 defaults.

CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# Flash + PSRAM (DSI framebuffers + LVGL buffers live in PSRAM).
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000

# WiFi via the onboard ESP32-C6 slave (esp_wifi_remote + esp_hosted over SDIO).
# ESP32-P4 has no native radio; this routes esp_wifi_* to the C6.
CONFIG_ESP_WIFI_REMOTE_ENABLED=y

# TLS for the Spotify Web API (same approach as the CYD IDF build).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# cp3: free the mbedTLS handshake buffers after each connect (TLS to Spotify).
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# cp3: PSRAM-first heap policy (see docs/PORT-NOTES.md). Allocations >4 KB --
# the Spotify response/JPEG buffers -- spill to PSRAM instead of the scarce
# 768 KB internal SRAM; WiFi/lwip buffers also move to PSRAM. PSRAM is already
# in the heap allocator (boot log), so this just tightens the threshold and
# relieves internal SRAM as TLS lands.
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

# LVGL 9.4 (Kconfig-driven; the board uses esp_lvgl_adapter, not lv_conf.h).
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
# EXPERIMENT REVERTED (2026-06-11, on-hardware boot loop): two SW draw units
# conflict with the BSP's PPA acceleration. The adapter warns "PPA acceleration
# requires LV_DRAW_SW_DRAW_UNIT_CNT == 1" but its ppa_fill hook still runs from
# both render threads, overruns the PPA client's pending-transaction queue on
# the first frame, and ESP_ERROR_CHECK aborts -> reboot loop. Keep this at 1
# unless PPA is disabled first (and PPA's hardware rotation is the bigger win).
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
# cp2: WiFi stack pushed internal SRAM ~2 KB over. Don't force LVGL hot
# functions into IRAM -- frees several KB of IRAM (and silences the
# .iram1 section-conflict warnings). Negligible render cost for this UI.
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n
# Freeze diagnosis: turn LVGL's own logging on so an out-of-memory / draw
# assert PRINTS (via printf) instead of silently spinning the render task.
# WARN level stays quiet in normal operation.
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_LOG_PRINTF=y
# Fonts (bigger than the CYD's 12/16 for the 800x480 panel).
# Built-in bitmap fonts for hints + symbols (LVGL arrow/gear glyphs live here).
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
# Runtime tiny_ttf is unsafe on this P4/LVGL path. Extended Spotify metadata is
# provided by compiled hc fonts in p4_shared instead.
# CONFIG_LV_USE_TINY_TTF is not set

# ── Reliability: crash coredump-to-flash + task watchdog auto-reset ─────────
# A panic (abort/store-fault/assert) or a watchdog timeout writes an ELF core
# dump to the `coredump` partition; app_core_reliability_boot_report() prints
# the crashing task + PC on the NEXT boot and then erases it. Resolve the PC
# with: xtensa/riscv addr2line -e build/<app>.elf 0x<pc>  (or idf.py
# coredump-info for the full dump before it is erased).
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_STACK_SIZE=1280
# Task watchdog: reset (not just warn) if either idle task is starved for 20 s
# -- catches a wedged render/task freeze instead of hanging forever. 20 s is
# generous so long-but-legitimate work (OTA writes, art decode) never trips it.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
